#include<stdio.h>

int main(){
    int x = 10;
    int *ptr;

    ptr = &x;
    printf("Before : x = %d\n", x);
    *ptr = 20;
    printf("After : x = %d\n", x);

    return 0;
}

/*
บรรทัดที่ 1 ประกาศเรียกใช้ไลบารี stdio.h
บรรทัดที่ 3 ประกาศฟังก์ชัน main
บรรทัดที่ 4 ประกาศตัวแปรจำนวนเต็มชื่อ x มีค่าเท่ากับ 10
บรรทัดที่ 5 ประกาศตัวแปรpointer ชื่อ ptr
บรรทัดที่ 7 ให้ ptr มีค่าเท่ากับที่อยู่ของ x
บรรทัดที่ 8 แสดงผลหน้าจอ Before เป็นค่าของ x
บรรทัดที่ 9 ไปที่ตำแหน่งที่ ptr ชี้อยู่แล้วเปลี่ยนค่าเป็น 20 เพื่อเปลี่ยนค่าของ x
บรรทัดที่ 10 แสดงผลหน้าจอ After เป็นค่าของ x
บรรทัดที่ 12 คืนค่าโปรแกรมเป็น 0
*/