#include<stdio.h>

void swap(int *a, int *b){
    int box = *a;
    *a = *b;
    *b = box;
}

int main(){
    int a = 5, b = 10;

    printf("Before swap : a = %d, b = %d\n", a, b);
    swap(&a, &b);
    printf("After swap : a = %d, b = %d\n", a, b);

    return 0;
}

/*
บรรทัดที่ 1 เรียกใช้ไลบารี stdio.h
บรรทัดที่ 3 ประกาศฟังก์ชัน swap ที่รับค่า pointer a, pointer b
บรรทัดที่ 4 ประกาศตัวแปรชนิดจำนวนเต็มชื่อ box โดยให้เท่ากับ pointer a หรือก็คือกำหนดให้พื้นที่ว่าง เท่ากับ ค่าที่pointer a ชี้อยู่ ซึ่งก็คือ 5
บรรทัดที่ 5 สั่งให้ไปที่ตำแหน่งที่ a ชี้อยู่ แล้วเปลี่ยนค่าให้เท่ากับ ค่าที่ b ชี้อยู่ คือ เปลี่ยนค่าของ a ให้เท่ากับ 10
บรรทัดที่ 6 สั่งให้ไปที่ตำแหน่งที่ b ชี้อยู่ แล้วเปลี่ยนค่าให้เท่ากับ box เปลี่ยนค่าของ b เท่ากับ 5
บรรทัดที่ 9 ประกาศฟังก์ชัน main
บรรทัดที่ 10 ประกาศตัวแปรชนิดจำนวนเต็ม โดยให้ a = 5, b = 10
บรรทัดที่ 12 แสดงผลหน้าจอ Before swap a = %d, b = %d โดยเรียกค่าจากตัวแปร a, b ตามลำดับ
บรรทัดที่ 13 เรียกใช้ฟังก์ชัน swap โดยดึงส่งค่าที่อยู่ของ a b เพื่อใช้ในฟังก์ชัน swap
บรรทัดที่ 14 แสดงผลหน้าจอ After swap a = %d, b = %d โดยเรียกค่าจากตัวแปร a, b ที่ผ่านการดำเนินการในฟังก์ชัน void swap
บรรทัดที่ 16 คืนค่าโปรแกรมเป็น 0
*/
