#include<stdio.h>

void doubleArray(int *arr, int size){
    for (int i = 0; i < size; i++)
    {
        arr[i] = arr[i]*2;
    }
    
}

int main(){
    int a[] = {1, 2, 3, 4, 5};
    int size = 5;

    printf("Before : %d %d %d %d %d\n", a[0], a[1], a[2], a[3], a[4]);
    doubleArray(a, size);
    printf("After : %d %d %d %d %d", a[0], a[1], a[2], a[3], a[4]);
    return 0;
}
/*
บรรทัดที่ 1 ประกาศเรียกใช้ไลบารี stdio.h
บรรทัดที่ 3 ประกาศฟังก์ชัน doubleArray โดยรับค่าเป็นจำนวนเต็ม ที่เป็นค่าที่arrชี้อยู่ หรือตำแหน่งเริ่มต้นของarrayซึ่งก็คือ a[] และจำนวนเต็ม size (ขนาดของ array)
บรรทัดที่ 4 สร่าง for loop โดยกำหนดค่าเริ่มต้นเป็น 0 แล้วให้วันลูปจนมีค่าน้อยกว่าขนาดของarray โดยให้ค่า i เพิ่มขึ้น
บรรทัดที่ 6 กำหนด arr[i] = arr[i]*2 เพื่อนำค่า array ในทุก index มาคูณ 2
บรรทัดที่ 11 ประกาศฟังก์ชัน main()
บรรทัดที่ 12 ประกาศ a[] =  {1, 2, 3, 4, 5}
บรรทัดที่ 13 ประกาศตัวแปรตำนวนเต็ม ชื่อ size = 5 (มาจากขนาดของarray)
บรรทัดที่ 15 แสดงผลหน้าจอ Before : %d %d %d %d %d โดยเรียกค่ามาจาก a[0], a[1], a[2], a[3], a[4] ตามลำดับ
บรรทัดที่ 16 เรียกใช้ฟ้งก์ชัน doubleArray โดยส่งค่า a และ size เข้าฟังก์ชัน
บรรทัดที่ 17 แสดงผลหน้าจอ After : %d %d %d %d %d โดยเรียกค่ามาจาก a[0], a[1], a[2], a[3], a[4] ตามลำดับ โดยเป็นค่าที่ผ่านการดำเนินการใน doubleArray
บรรทัดที่ 18 คืนค่าโปรแกรมเป็น 0
*/